Финансы/src/Documents/РасходДенежныхСредств/РасходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенежныхСредств</name>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <registerRecords>InformationRegister.ИсторияЦенПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СразуСписывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоТранзакцииИзБанкКлиента</name>
    <type>
      <types>CatalogRef.МестаТранзакцийИзБанкКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧекРасшифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЧека</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расшифровка</name>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Финансы/src/AccumulationRegisters/ОстаткиДенежныхСредств/ОстаткиДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДенежныхСредств</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Финансы/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПрихода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаДвижения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Финансы/src/InformationRegisters/ИсторияЦенПокупок/ИсторияЦенПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЦенПокупок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Финансы/src/Documents/РасходДенежныхСредств/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Перем СтруктураШапка, МассивСтрокТаблицыРасшифровка;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		МестоРасходовДенежныхСредств = Константы.ОсновноеМестоРасходаДенежныхСредств.Получить();
		СчетУчета = Константы.ОсновнойСчетУчета.Получить();
		Если ЗначениеЗаполнено(СчетУчета) Тогда
			ВалютаДокумента = СчетУчета.ВалютаСчета;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		Документы.РасходДенежныхСредств.ПолучитьДанныеЗаполненияПоСчетуНаОплату(ДанныеЗаполнения, СтруктураШапка, МассивСтрокТаблицыРасшифровка);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураШапка, "МестоРасходовДенежныхСредств,СчетУчета,ВалютаДокумента");
		Для Каждого ТекЭлементМассива Из МассивСтрокТаблицыРасшифровка Цикл
			НоваяСтрока = Расшифровка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлементМассива, "СтатьяРасходов,Цена,Количество,Сумма,СуммаВзаиморасчетов");
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Расшифровка.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыДвижений(ТаблицаДляОстатков, ТаблицаДвиженийДенежныхСредств, ТаблицаИсторияЦенПокупок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	РасходДенежныхСредств.Дата КАК Период,
		|	РасходДенежныхСредств.СчетУчета,
//		|	РасходДенежныхСредств.ДокументОснование,
		|	РасходДенежныхСредств.СуммаДокумента КАК Сумма
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|ГДЕ
		|	РасходДенежныхСредств.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходДенежныхСредств.Дата КАК Период,
		|	РасходДенежныхСредств.СчетУчета,
		|	РасходДенежныхСредств.ВалютаДокумента КАК ВалютаДвижения,
		|	РасходДенежныхСредствРасшифровка.СтатьяРасходов КАК СтатьяДоходовРасходов,
		|	РасходДенежныхСредств.МестоРасходовДенежныхСредств,
		|	СУММА(0) КАК СуммаПрихода,
		|	СУММА(РасходДенежныхСредствРасшифровка.Сумма) КАК СуммаРасхода
		|ИЗ
		|	Документ.РасходДенежныхСредств.Расшифровка КАК РасходДенежныхСредствРасшифровка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|		ПО РасходДенежныхСредствРасшифровка.Ссылка = РасходДенежныхСредств.Ссылка
		|ГДЕ
		|	РасходДенежныхСредств.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходДенежныхСредств.Дата,
		|	РасходДенежныхСредств.ВалютаДокумента,
		|	РасходДенежныхСредств.СчетУчета,
		|	РасходДенежныхСредствРасшифровка.СтатьяРасходов,
		|	РасходДенежныхСредств.МестоРасходовДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Выборка.Дата КАК Период,
		|	Выборка.МестоРасходовДенежныхСредств,
		|	Выборка.СтатьяРасходов,
		|	ВЫБОР
		|		КОГДА Выборка.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ Выборка.Сумма / Выборка.Количество
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасходДенежныхСредств.Дата КАК Дата,
		|		РасходДенежныхСредств.МестоРасходовДенежныхСредств КАК МестоРасходовДенежныхСредств,
		|		РасходДенежныхСредствРасшифровка.СтатьяРасходов КАК СтатьяРасходов,
		|		СУММА(РасходДенежныхСредствРасшифровка.Количество) КАК Количество,
		|		СУММА(РасходДенежныхСредствРасшифровка.Сумма) КАК Сумма
		|	ИЗ
		|		Документ.РасходДенежныхСредств.Расшифровка КАК РасходДенежныхСредствРасшифровка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|			ПО РасходДенежныхСредствРасшифровка.Ссылка = РасходДенежныхСредств.Ссылка
		|	ГДЕ
		|		РасходДенежныхСредств.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РасходДенежныхСредств.Дата,
		|		РасходДенежныхСредств.МестоРасходовДенежныхСредств,
		|		РасходДенежныхСредствРасшифровка.СтатьяРасходов) КАК Выборка";

	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();

	ТаблицаДляОстатков				= МассивРезультатов[0].Выгрузить();
	ТаблицаДвиженийДенежныхСредств	= МассивРезультатов[1].Выгрузить();
	ТаблицаИсторияЦенПокупок		= МассивРезультатов[2].Выгрузить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
Перем ТаблицаДляОстатков, ТаблицаДвиженийДенежныхСредств, ТаблицаИсторияЦенПокупок;
	
	ЗаполнитьТаблицыДвижений(ТаблицаДляОстатков, ТаблицаДвиженийДенежныхСредств, ТаблицаИсторияЦенПокупок);
	
	Если ТаблицаДляОстатков.Количество() <> 0 Тогда
		
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движения.ОстаткиДенежныхСредств.Загрузить(ТаблицаДляОстатков);
		
	КонецЕсли;
	
	Если ТаблицаДвиженийДенежныхСредств.Количество() <> 0 Тогда
		
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движения.ДвиженияДенежныхСредств.Загрузить(ТаблицаДвиженийДенежныхСредств);
		
	КонецЕсли;
	
	Если ТаблицаИсторияЦенПокупок.Количество() <> 0 Тогда
		
		Движения.ИсторияЦенПокупок.Записывать = Истина;
		Движения.ИсторияЦенПокупок.Загрузить(ТаблицаИсторияЦенПокупок);
		
	КонецЕсли;
	
	//Если ТипЗнч(ТаблицаДляОстатков.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
	//	
	//	//Движения.ПланируемыеРасходы.Записывать = Истина;
	//	//Движения.ПланируемыеРасходы.Загрузить(ТаблицаДляОстатков);
	//	
	//КонецЕсли;
	
КонецПроцедуры

мВалютаРегламентированногоУчета = Константы.ОсновнаяВалютаУчета.Получить();
